/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   error_check.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: euhong <euhong@student.42seoul.kr>         +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/03/10 19:32:18 by euhong            #+#    #+#             */
/*   Updated: 2021/03/10 19:54:55 by euhong           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft.h"

t_info	info; // malloc하기

int		check_err(int fd, char **map)
{
	//유효하지 않은 지도이면 1을 리턴 아닐경우 0리턴
	return (0);
}
